performance_tests/databases/results/sysbench-mariadb.txt
sysbench 1.0.20 (using system LuaJIT 2.1.1727870382)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            642712
        write:                           178544
        other:                           90085
        total:                           911341
    transactions:                        44177  (736.13 per sec.)
    queries:                             911341 (15185.91 per sec.)
    ignored errors:                      1731   (28.84 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0120s
    total number of events:              44177

Latency (ms):
         min:                                    7.11
         avg:                                   10.87
         max:                                  359.67
         95th percentile:                        0.00
         sum:                               480005.24

Threads fairness:
    events (avg/stddev):           5522.1250/17.71
    execution time (avg/stddev):   60.0007/0.00