performance_tests/databases/results/sysbench-result-mysql.txt
sysbench 1.0.20 (using system LuaJIT 2.1.1727870382)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            596176
        write:                           170336
        other:                           85168
        total:                           851680
    transactions:                        42584  (709.61 per sec.)
    queries:                             851680 (14192.28 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0099s
    total number of events:              42584

Latency (ms):
         min:                                    7.78
         avg:                                   11.27
         max:                                  351.91
         95th percentile:                        0.00
         sum:                               480018.79

Threads fairness:
    events (avg/stddev):           5323.0000/5.59
    execution time (avg/stddev):   60.0023/0.00