performance_tests/databases/results/sysbench-result-pg.txt
sysbench 1.0.20 (using system LuaJIT 2.1.1727870382)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            640332
        write:                           182827
        other:                           91537
        total:                           914696
    transactions:                        45706  (761.66 per sec.)
    queries:                             914696 (15242.71 per sec.)
    ignored errors:                      32     (0.53 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0085s
    total number of events:              45706

Latency (ms):
         min:                                    6.99
         avg:                                   10.50
         max:                                   47.86
         95th percentile:                        0.00
         sum:                               480012.59

Threads fairness:
    events (avg/stddev):           5713.2500/11.19
    execution time (avg/stddev):   60.0016/0.00